Да се напише код којшто од стандарден влез ќе чита информации за една фискална сметка на следниот начин:
  најпрво ќе чита број N
  потоа ќе чита уште N парови вредности од следниот формат:
    пр: 5 100 A 50 Б 66 A 77 B 88 V
каде што првата вредност во парот изнесува износот на некој купен артикал, додека пак втората 
вредност е карактер (A,B V) што означува каков тип на  данок се пресметува во тој артикал:
    A 18%
    B 5%
    V 0%
Да се испечати од стандарден излез колку ќе изнесува повратокот на ДДВ за фискалната сметка што е
вчитана од стандарден влез, Повратокот на ДДВ се пресметува како 15% од вкупното наплатено ДДВ

#include <iostream>
using namespace std;

int main() {
    int n, price;
    cin >> n;
    char tax;
    float totalTax = 0.0;
    for (int i = 0; i < n; i++) {
        cin >> price >> tax;
        if (tax == 'A') {
            totalTax += price * 0.18;
        } else if (tax == 'B') {
            totalTax += price * 0.05;
        }
    }
    cout << totalTax * 0.15 << endl;
    return 0;
}
